[{"keywords":"Dennis Mai, Blog, Fatherhood","title":"Dennis Mai - Being a Present and Mindful Father","description":"Being present and mindful as a father -- being your best self so that your child/children can be their best selves","extension":".md","updatedAt":1616959846297,"toc":[{"id":"being-a-present-father","depth":1,"text":"Being a Present Father"}],"body":"<h1 id=\"being-a-present-father\">Being a Present Father</h1>\n<p>I love my job. I love programming and web development. I could spend all day learning, experimenting, and building things. Some days, I do do that. That's okay sometimes.</p>\n<p>And sometimes, that's not okay.</p>\n<p>The internet, full of documentation, articles, and awesome work, is never more a few finger swipes away. Because my work mostly happens in my head, it's easy for me to keep working when I'm not in front of the computer. It's easy for me to lay in bed and think about how to implement the solution to my current problem.</p>\n<p>Even when I'm with my family, I can become lost in thought. I <strong>have</strong> to make <em>continuous and conscious effort</em> to put aside my plans, ideas, and thoughts--personal or professional--in order to be <em>fully present</em> with my family. They deserve my attention, and I need to be the best version of myself, so they can be the best versions of themselves.</p>\n<p>Why else be a father? Why else be a husband? I made the conscious decision to be a father and <em>embrace a future I cannot control.</em> That's adventure, an odyssey, a hard and arduous journey, one full of long hours, and skill grinding. It's real. And the prizes are for those who can endure. Yes, there are litle victories and progress, big ones too. But the big payoffs don't come all at once. You gotta earn'em.</p>\n<p>Now, there's a time for me to be a developer and programmer. There will always be time. But there won't always be time for me to spend with my toddler. By definition, it only lasts a few years.</p>\n<p>My time with my family--our time <em>together</em>--is more important than my time making things or expressing myself. Yes, I can always make time for that, especially when I need to, but I know what's most important to me.</p>\n<p>My parents were always physically present, more or less, but they worked constantly. My mother owned her own businesses and my father, when he wasn't earning money, was constantly fixing, maintaining, or building something in the garage or yard. Eventually, when I was old and strong enough, I would do the same thing with him, and that's how we bonded. But that wasn't until I was much older.</p>\n<p>That's not to say my parents weren't there when I needed them. They were just occupied, busy taking care of our lives. Busy building a future for me. They were and ARE the best parents, and I love them immensely.</p>\n<p>And I want to be that for my children. One day, maybe we can do projects together. But when we're together, we're together in the same place and time. And I'm not somewhere else.</p>"},{"keywords":"Dennis Mai, Weird Wide Web, Brazilian Jiu Jitsu, BJJ, Choke Holds, BJJ Strangulations","title":"My Favorite BJJ Chokes","description":"An oddly specific list of Dennis Mai's favoriate Brazilian Jiu jitsu chokes and strangulations.","extension":".md","updatedAt":1606690800000,"toc":[{"id":"jiu-jitsu-chokes-and-strangulations---my-favorite-ways-to-safely-submit-someone","depth":1,"text":"Jiu Jitsu Chokes and Strangulations - My Favorite Ways to Safely Submit Someone"},{"id":"summary","depth":2,"text":"Summary"}],"body":"<h1 id=\"jiu-jitsu-chokes-and-strangulations---my-favorite-ways-to-safely-submit-someone\">Jiu Jitsu Chokes and Strangulations - My Favorite Ways to Safely Submit Someone</h1>\n<p>This may sound weird (or it won't, if you're familiar with Jiu Jitsu), but I have a very specific list of favorite chokes for Jiu Jitsu.</p>\n<p>In order, they have GOT to be:</p>\n<ol>\n<li><a href=\"https://www.youtube.com/watch?v=fuvgllnmp3g\">The Ezekiel Choke</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=9Y6MmSR6LjU\">The Loop Choke</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=l8-JI7NND3E\">The Rear Naked Choke</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=yrUXIujVGTM\">The Bow-and-Arrow Choke</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=A4LQMLYJ9yo\">The Anaconda</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=0Dx5Ecj2yV4\">The D'arce</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=VkI7wuhN2Ps\">The North-South Choke</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=kxCCrUACAwM\">The Peruvian Necktie</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=raUOzIkDt5k\">The Arm-in Guillotine</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=2uAzRUGtnkA\">THE MOTHER'S MILK</a></li>\n</ol>\n<p><em>BONUS</em> <a href=\"https://www.youtube.com/watch?v=waM29uvV1Wo\">The Triangle Choke.</a> (This should be #1, but it's such a staple. C'mon!)</p>\n<p>I'll let the experts explain the details. Needless to say, there are countless resources for perfecting each technique, and you won't find them on youtube.</p>\n<p><strong>PRACTICE WITH SAFETY. I AM NOT LIABLE FOR ANY INJURY CAUSED. I CAN'T BELIEVE I HAVE TO SAY THAT</strong></p>\n<h2 id=\"summary\">Summary</h2>\n<p>If you haven't yet, go start Brazilian Jiu Jitsu. It isn't for everyone, but if you're comfortable in uncomfortable situations, enjoy being rowdy, and like bonding with people by simulating murder in pajamas, then it's for you. The choking isn't bad either.</p>"},{"keywords":"Dennis Mai, Blog, Weird Wide Web, Web Development, Learning","title":"Dennis Mai - How I Usually Learn New Tech","description":"How I, and probably most people, end up learning new tech","extension":".md","updatedAt":1616959846317,"toc":[{"id":"how-i-usually-learn-new-tech","depth":1,"text":"How I Usually Learn New Tech"},{"id":"choose-your-tech","depth":2,"text":"Choose Your Tech"},{"id":"find-the-company-using-the-tech","depth":2,"text":"Find the Company Using the Tech"},{"id":"leveraging","depth":2,"text":"Leveraging"},{"id":"summary","depth":2,"text":"Summary"}],"body":"<h1 id=\"how-i-usually-learn-new-tech\">How I Usually Learn New Tech</h1>\n<p>I mentioned in a previous post how important it is to keep learning to both deepen and broaden your skillset as a programmer. In that same post, I made it extra clear that we have to choose what we want to learn wisely. But as it turns out, there's at least one solid method of learning new technology.</p>\n<p>Getting paid to do it, duh.</p>\n<p>Literally, companies pay you to <em>learn</em> how to build stuff. And either you or somebody you know (your boss, colleague, etc.) will choose <em>what</em> to build that stuff with. So you can do the following:</p>\n<ol>\n<li>\n<p>Choose or influence the decision to use the tech you want to learn, or</p>\n</li>\n<li>\n<p>Find a company using a technology you don't already know about but really really want to get ridiculously good at, and then go work for them</p>\n</li>\n</ol>\n<p>I am by no means a senior developer, but in my relatively short career, I have with luck and wherewithall done both. I can assure you, no matter your seniority, that you can do the same.</p>\n<h2 id=\"choose-your-tech\">Choose Your Tech</h2>\n<p>Choosing our technologies has major repercussions for businesses and colleagues. It should neither be taken lightly nor alone, if possible.</p>\n<p>That said, sometimes choosing the tech stack is trivial. For example, if you are in a major tech hub and the decision you need to make it what frontend framework you want to use. You have certain criteria that rule out all but the big 3: Angular, React, or Vue. After weighing the options, you and the team conclude that using any of them would work equally. What would you choose?</p>\n<p>All things being equal, <em>I</em> would choose the framework that I am least familiar with, just to scratch that itch, to <em>widen</em> my skill set.</p>\n<p>Others might choose to use the tech they are most comfortable with. That is also a sound decision, and is a sure way to <em>deepen</em> our skill set.</p>\n<p>You have to make the decision for yourself whether either widening or deepening is more important for your career and personal growth.</p>\n<h2 id=\"find-the-company-using-the-tech\">Find the Company Using the Tech</h2>\n<p>This is how I learned (am learning) Vue.js. I found a company that ticked all the boxes, INCLUDING the box that scratches my itch for learning something new, and that made things even better.</p>\n<p>Of course, it helps that I already know Angular and React. Javascript is javascript. (right?). And this is key in learning new...well, anything, really. We can leverage our past experience to learn new things if they are similar in the right ways. </p>\n<h2 id=\"leveraging\">Leveraging</h2>\n<p>Given that we can learn new things through using what we've learned in the past, we have to be careful and tread lightly. Sometimes we can bring patterns with us that don't serve our purpose in learning something new. </p>\n<p>Take, for example, learning regular Javascript coming from a C# background. C# is an object-oriented (OO) language, so it uses OO conventions, such as private variables, inheritance, etc.</p>\n<p>Javascript can implement to some extent the features of OO languages using class syntax. But it is <strong>not</strong> an OO language. Developers who are used to coding in OO languages can get by just fine using the same patterns they're used to, but there will be tricky parts that don't behave as they normally would.</p>\n<p>If you're learning Javascript coming from an OO language, immerse yourself in the \"Javascript\" way of doing things, meaning <em>using</em> prototypical inheritance and function programming patterns. Everything is a function, so work with that -- not against that.</p>\n<p>Like in learning any language, natural or otherwise, it is best to IMMERSE yourself completely in the <em>culture</em> of the language to learn it as it was meant to be used. Let go of the past and embrace what's in front of you.</p>\n<p>You cannot fill a glass that's already full, as the saying goes.</p>\n<h2 id=\"summary\">Summary</h2>\n<p>So go out there and learn new things. Seek out opportunities to deepen and widen your skills, but don't do it with half an ass. Don't bring baggage that will weigh you down. When you learn something, learn it right using the conventions.</p>"},{"keywords":"ejs, webpack, blog, markdown, simple blog, Vanilla JS, GSAP, Lean Web, JAM Stack","title":"Dennis Mai - How I Made My Blog","description":"How I made my blog using just ejs, webpack, scss, and vanilla JS. (And GSAP for animations. It's unnecessary -- but fun)","extension":".md","updatedAt":1605826800000,"toc":[{"id":"how-i-made-this-blog","depth":1,"text":"How I Made This Blog"},{"id":"the-tech","depth":2,"text":"The Tech"},{"id":"ejs","depth":3,"text":"EJS"},{"id":"i-am-using-webpack-version-4","depth":3,"text":"I am using Webpack version 4"},{"id":"sass-scss","depth":3,"text":"SASS (scss)"},{"id":"vanilla-javascript","depth":3,"text":"Vanilla Javascript"},{"id":"gsap","depth":3,"text":"GSAP"},{"id":"project-setup","depth":3,"text":"Project Setup"},{"id":"multi-page-sites-with-webpack","depth":4,"text":"Multi-page sites with Webpack"},{"id":"transform-markdown-to-ejs-and-then-to-plain-html","depth":4,"text":"Transform Markdown to EJS and then to plain HTML"},{"id":"updating-posts-and-preventing-full-rewrites","depth":4,"text":"Updating Posts and Preventing Full Rewrites"},{"id":"dynamic-entry-object-for-webpack","depth":4,"text":"Dynamic entry object for Webpack"},{"id":"the-html-files","depth":4,"text":"The HTML files"},{"id":"caveat","depth":4,"text":"Caveat"},{"id":"summary","depth":2,"text":"Summary"}],"body":"<h1 id=\"how-i-made-this-blog\">How I Made This Blog</h1>\n<p>First, this is a custom solution that's probably only applicable for small blogs (less than a few hundred posts). Anything more will take a long time to build, for reasons I will explain below.</p>\n<p>Second, This blog was built just for fun. While webpack supports building multiple pages with multiple entry points, it was probably never intended for full-blown blog building. There are other tools better suited for the job, like Next.js, Huge, Jekyll, Eleventy, and the like.</p>\n<p>That said, if you want to do something similar just for fun, read on!</p>\n<h2 id=\"the-tech\">The Tech</h2>\n<p>I tried to make a blog using the SIMPLEST technlogies available, with as few tools as possible while still allowing for website optimizations.</p>\n<ul>\n<li><a href=\"https://ejs.co/\">EJS</a> templates to reuse components.</li>\n<li><a href=\"https://webpack.js.org/\">Webpack v4</a> for the dev server, building, and optimizations.</li>\n<li><a href=\"https://sass-lang.com/documentation/syntax\">SASS</a> for reusing CSS.</li>\n<li><a href=\"https://vanillajstoolkit.com/\">Vanilla JS</a>, because I don't like dependencies. Webpack is terrible enough.</li>\n<li><a href=\"https://greensock.com/docs/\">GSAP</a> For animations. This website is actually my first time using GSAP.</li>\n</ul>\n<h3 id=\"ejs\">EJS</h3>\n<p>Why? Because I'm already very familiar with the syntax. And when building projects that you expect to last a while, it's probably best to use an 80/20 stack mix of tech you know well with new tech you want to learn, which is why...</p>\n<h3 id=\"i-am-using-webpack-version-4\">I am using Webpack version 4</h3>\n<p>Webpack 5 just came out, and its release is a hot debate, because, well, it's like they didn't even try to see what would and wouldn't break. I know and love (and kind of hate) Webpack 4, so I'm stickin' with the old guns for now. Also, it's in plain Javascript, so even when I have to learn something new--like making a blog--it's not too much of a stretch figuring things out.</p>\n<h3 id=\"sass-scss\">SASS (scss)</h3>\n<p>I love it. It's actually mostly unnecessary with the power of the current CSS3 api, but, again, I know it well and I enjoy it.</p>\n<h3 id=\"vanilla-javascript\">Vanilla Javascript</h3>\n<p>This was a no-brainer. At the time of this writing, I'm only familiar with React. I'm no expert, but I'm certainly no novice at this point. I would love to learn Vue, Svelte, Preact, and even Angular, but I also want this site to be as fast as possible and rely on as few dependencies as possible. And that's not a realistic expection when using those Javascript libraries or frameworks. Vanilla Javascript is good. It's performant, and you really don't need more.</p>\n<h3 id=\"gsap\">GSAP</h3>\n<p>Okay, GSAP is my 20%. I had never worked with GSAP before and had only heard good things. So I'm giving it a shot, and so far, it's wonderful. Very fun, very intuitive, and VERY powerful. Highly recommended.</p>\n<h3 id=\"project-setup\">Project Setup</h3>\n<pre><code>root    |- configs...\n        |- src  |- components\n                |- fonts\n                |- images\n                |- pages\n                |- posts\n                |- scripts\n                |- styles\n                |- views\n</code></pre>\n<p>I have all the code in the root/src folder with configs for postcss and webpack under the root directory. I use separate webpack configs for dev and production and use webpack-merge to merge them with common configurations.</p>\n<p>I am also hosting on Netlify, which is its own topic.</p>\n<p>In my src folder, I have directories hosting my assets.</p>\n<p>I have styles in its own folder, but you can host them any way you like, including next to their pages (or their views or their components or wherever. It doesn't matter).</p>\n<p>Of particular importance are my pages, posts, and views folders.</p>\n<h4 id=\"multi-page-sites-with-webpack\">Multi-page sites with Webpack</h4>\n<p>My Webpack entry points are pointing the pages directory. Each file there there is its own entrypoint, except for blog posts. There is 1 entrypoint for each post (in the posts directory), which all use the same styles and javscript. This is not ideal, but I couldn't get webpack to reuse my entrypoints with the splutChunks options. I might try it again later, but it was extremely frustrating.</p>\n<h4 id=\"transform-markdown-to-ejs-and-then-to-plain-html\">Transform Markdown to EJS and then to plain HTML</h4>\n<p>I am using <a href=\"https://github.com/cenguidanos/node-markdown-parser\">@cenguidanos/node-markdown-parser</a> to return an array of all my posts with their meta content such as title, description and keywords in a json object. To do that, I make use of <code>fs.readdirSync</code> and <code>fs.readFileSync</code> to grab the all the posts and their data.</p>\n<p>With that data, I construct an ejs template that reuses header and footer components. I then write the template to a corresponding ejs file in the views directory using <code>fs.writeFile</code>.</p>\n<h4 id=\"updating-posts-and-preventing-full-rewrites\">Updating Posts and Preventing Full Rewrites</h4>\n<p>The tools provided don't provide a simple way of checking if the date being written or read is new or old. In particular the markdown parser will simply create the file with a new updatedAt date, which can be problematic when you didn't update the post.</p>\n<p>The way I dealt with this problem is actually be keeping the list of blog data in a simple database file called db.json, to which I compare the new blog data. We construct a new array of the blog data using old, unchanged entries with new and updated entries and write that to the 'database'. This way, the keep the meta data -- especially the updatedAt date -- in tact.</p>\n<h4 id=\"dynamic-entry-object-for-webpack\">Dynamic entry object for Webpack</h4>\n<p>Before I create any html files, though, I have to create my entry points for Webpack. Using the pages directory, I construct an object with the name of the page file and its path. For posts, I begin with the name 'posts1', since I will need to create 1 entry for each blog post (ugh. Annoying. And VERY non-performant).</p>\n<h4 id=\"the-html-files\">The HTML files</h4>\n<p>Now, in order to create all those html files with their css and js files embedded, I get all the ejs files from the views directory and use the <a href=\"https://www.npmjs.com/package/glob\">glob</a> package to get their paths. It's also possible with the fs module, but glob is easier.</p>\n<p>I then use <code>Array.reduce()</code> to construct a new array of HtmlWebpackPlugin instances of ALL the ejs files, injecting their meta data and associating the appropriate chunk (css and js file) with their names. if they are posts, I have to handle them slightly differently.</p>\n<p>Here, I also check if the ejs file is associated with a post that was deleted (no longer in the posts directory). If it's not there, posts is undefined, so I use <code>fs.unlink</code> to delete it from the views.</p>\n<p>In the Webpack Plugins array, I concat the HtmlWebpackPlugins array with MiniCssExtractPlugin, Critters to inline the css, and CleanWebpackPlugin.</p>\n<p>The rest is of my webpack config is just configuring scss, ejs, injecting my fonts and images, and setting node rules for different modules.</p>\n<p>And there you have it!</p>\n<h4 id=\"caveat\">Caveat</h4>\n<p>With ejs templates in webpack, the dev server will <em>not</em> reload the browser if there are nested ejs templates. That's annoying when we are reusing components defined in .ejs files.</p>\n<p>The dev server only checks if the entrypoint files or their indexes (the root ejs pages) have changed, not their nested templates.</p>\n<h2 id=\"summary\">Summary</h2>\n<p>This was a lot of setup for a small blog. But it's pretty lightweight, and a lot easier to set up than a full-blown blog CRUD app.</p>\n<p>That set, it's probably easier to use Huge, Jekyll, or Eleventy. I'll experiment with those later.</p>"},{"keywords":"Dennis Mai, Blog, Development, Weird Wide Web, Node, Webpack, EJS, Vanilla JS, Lean Web, JAMstack","title":"Dennis Mai - Introduction to My Blog","description":"A short introduction to Dennis Mai's blog and website.","extension":".md","updatedAt":1605049200000,"toc":[{"id":"introduction-to-this-website-and-blog","depth":1,"text":"Introduction to this Website and Blog"},{"id":"my-promise-to-you","depth":2,"text":"My Promise to You"}],"body":"<h1 id=\"introduction-to-this-website-and-blog\">Introduction to this Website and Blog</h1>\n<p>Greetings web <a href=\"#note1\">surfer*</a> and welcome back to the weird web!</p>\n<p>This website is a work of <em>self expression</em>. Here I lay to bare my thoughts, ideas, my learning and doubt.</p>\n<p>It's also a homage to the primordial <a href=\"https://indieweb.org/\">indie web</a> that makes the internet such a fascinating place. </p>\n<p>This website is also my own custom blog. It is far from perfect, but it's mine. I write about Technology, Society &#x26; Culture, Brazilian Jiu Jitsu, Fatherhood, being a husband (Husband...hood?), and lots of other things.</p>\n<h2 id=\"my-promise-to-you\">My Promise to You</h2>\n<p>This place is a work in progress. Right now, it's not 100% accessible, but I will continue to make it as accessible to as many people as I can.</p>\n<p>That said, you can always send me feedback via email.</p>\n<p>Enjoy the tour, and and I hope you'll be inspired to make the web a little bit better. And a little bit weirder.</p>\n<p><a href=\"#introduction-to-this-website-and-blog\">Back to the top</a></p>\n<p><em><a name=\"note1\"></a> * When the internet was first becoming popular, it was called the \"World Wide Web\", and those browsing the internet then were \"surfing the web.\" Good times.</em></p>"},{"keywords":"Dennis Mai, Blog, Weird Wide Web, Philosophy, Stoicism","title":"Dennis Mai - Practicing Stoicism, Otherwise Known as Being Practical","description":"My personal, somewhat successful methods, of being Stoic","extension":".md","updatedAt":1616959846344,"toc":[{"id":"practicing-stoicism","depth":1,"text":"Practicing Stoicism"}],"body":"<h1 id=\"practicing-stoicism\">Practicing Stoicism</h1>\n<p>I am not a good stoic. I don't meditate regularly. I often lose my temper.</p>\n<p>But that doesn't mean I don't try. And that doesn't mean you shouldn't either.</p>\n<p>The essence of Stoicism is recognizing the reality of our and others' lives, accepting that reality as it is, and acting in the way that best serves all parties for the greater good, whether or not they recognize what's best.</p>\n<p>The philosophy often aligns well with Utilitarianism, which at its essence can be summarized as being ultimately, and extremely, practical.</p>\n<p>So I just like to say that being stoic is being practical. And I like that, because It means I can fall back to a simple mental model, a question with a binary response.</p>\n<p>Is this practical?</p>\n<p>When my toddler angers me, will my response be practical? Or will it just be emotional? Will it teach her -- and me -- to respond better in the future?</p>\n<p>When a driver cuts me off, will my response be emotional? Will I properly communicate the error? Will my communication be properly received?</p>\n<p>When I push a git branch for review and I get some harsh critism, will I take the criticism, and the reviewer, for what it is? Will I learn from it? Is the person normally this critical, or did they misunderstand? Did <em>I</em> misunderstand?</p>\n<p>Being a stoic isn't easy. It means we have to reflect. A lot. On ourselves, our motivations, our desires and reactions. It means being hard, and forgiving. It means holding ourselves to a higher standard, and others to their own. It means putting ourselves in others' shoes. It means being humble, open, kind, persistent, just and courageous.</p>\n<p>It makes us better.</p>"},{"keywords":"Dennis Mai, Blog, Development, Weird Wide Web, Leetcode, Side Projects, Motivation, Burnout, Hobbies","title":"Dennis Mai - How I Stay Sharp, Focused, and Motivated","description":"How I stay motivated to keep learning new technology","extension":".md","updatedAt":1616959846354,"toc":[{"id":"how-i-stay-sharp-and-motivated-to-keep-learning","depth":1,"text":"How I Stay Sharp and Motivated to Keep Learning"},{"id":"embracing-the-grind---prioritize","depth":2,"text":"Embracing the grind --Prioritize"},{"id":"learning-how-to-learn----my-personal-methods","depth":2,"text":"Learning how to learn -- my personal methods"},{"id":"switching-context","depth":2,"text":"Switching context"},{"id":"learning-how-to-learn","depth":2,"text":"Learning how to learn"},{"id":"taking-care-of-myself","depth":2,"text":"Taking care of myself"},{"id":"summary","depth":3,"text":"Summary"}],"body":"<h1 id=\"how-i-stay-sharp-and-motivated-to-keep-learning\">How I Stay Sharp and Motivated to Keep Learning</h1>\n<p>First, let's get this straight. it is impossible to be on top of all the advancements and development in new technology. Even the brightest, most senior, most intelligent Aspie who doesn't sleep but a minute a day couldn't keep up.</p>\n<p>But that's not a reason to stop learning. The industry demands it, but more importantly, your curiousity should, too. In order stay marketable and productive, we must both sharpen our current skills and gain new ones. We do this deepening our current skills through practice and research and by broadening the number of those skills through using new technology, reading, writing, and networking.</p>\n<p>Okay, sure, you can do just fine if you're not learning new technologies, depending on your niche and seniority. But unless you change careers, the lack of current skills eventually catches up.</p>\n<h2 id=\"embracing-the-grind---prioritize\">Embracing the grind --Prioritize</h2>\n<p>Given that there's too much for any one person to know. We have to choose wisely what we want to invest our time and energy learning, because it's a rare individual that can effectively learn and apply 15 programming languages, methodologies, best practices, library interfaces and apis, <em>with</em> soft skills to be a 10x developer.</p>\n<p>More than half of us don't stray far from average. That's statistics. And that's okay. So how do we best utilize our <em>average</em> resources to optimize our programming performance?</p>\n<p>By being strategic and calculated about what, when, and how we learn, and how we retain that knowledge.</p>\n<h2 id=\"learning-how-to-learn----my-personal-methods\">Learning how to learn -- my personal methods</h2>\n<p>I can't speak for everybody, but I learn best by following these steps:</p>\n<ol>\n<li>Figuring out what I want to do or learn, whether it be learning a new technology, addressing a specific, personal or professional need, or just fixing a bug.</li>\n<li>Learning what others have done to solve this specific problem, if it's been solved before. When there are multiple solutions, I find one that suits my needs the best.</li>\n<li>Applying whatever solution I find through IMPLEMENTING IT in my own code.</li>\n<li>Reading documentation, blogs, and other code to better implement the solution.</li>\n<li>Taking notes, breaks, and returning to the code later (between a few days to a few months, if I'm feeling spicy).</li>\n<li>Repeat steps 3 to 5.</li>\n</ol>\n<p>For me, it's really too academic to just read and take notes. I have to practice, implement, and act. Knowledge sinks in best when applied. Taking notes is also useful, but, without practice, it's just in-and-out, theoretical knowledge -- impractical.</p>\n<p>This method applies both to my professional and personal projects. It's how I keep up with old and new tech. When best practices, libraries, or APIs change, I refactor. That's also an amazing time to learn, especially from myself. It's how I benchmark my own progress as well, whether or not I can read my own code later, judging its readability, organization, efficiency, and efficacy.</p>\n<h2 id=\"switching-context\">Switching context</h2>\n<p>But it's not just projects I explore in. I'm constantly reading books and articles. I read when I'm awake and my brain is active, and when I tire, I take a break or do something completely different, such as go on a walk, do some exercises, go to Jiu Jitsu practice. Or play video games (my 'vice').</p>\n<p>When I'm bored of working on a project, I leetcode. And when that's boring, I work on a project, or read. You have to switch it up.</p>\n<p>My brain needs constant stimulation, but not always the same kind. That's why it's good for me to switch context. I'm almost always learning, and never vegging out, but what I'm learning and how is constantly varying. I can only work my attention span so long to be effective. But switching context is like a breath of fresh air.</p>\n<h2 id=\"learning-how-to-learn\">Learning how to learn</h2>\n<p>There are a lot of resources on this topic, but suffice it to say that this meta-skill is the most important skill to have. Period. This is the (post) Information age, where industries and fields are born and die within a generation and workers change careers multiple times, often within the same decade.</p>\n<p>You have to be flexible, emotionally, mentally, physically. It means moving. It means learning. It means being resilient. It's the new normal, and if you can't, you have to at least be taking care of yourself.</p>\n<h2 id=\"taking-care-of-myself\">Taking care of myself</h2>\n<p>I also notice an enormous different when I eat, sleep, and exercise correctly. It's too easy for me to get lost in code, reading, and knowledge. </p>\n<p>I can easily stay up late at night coding. But the different in the morning is especially stark. My toddler wakes up between 5 and 6:30 no matter what. Sometimes she she has nightmares. I can't plan for that. I can control when I go to bed, and I know I need at least 8 hours to function above 90% during the day. Coffee doesn't cut it.</p>\n<p>I also doesn't sleep well when I eat and drink poorly. Alcohol, especially, destroys the quality of my sleep, and junk food fogs my brain and attention. Lots of fatty, sugary food will do that. Eating lots of veggies, fruit and protein, with a healthy -- but not overly abundant -- dose of complex carbs keeps my mood steady throughout the day and my sleep extra nice.</p>\n<p>And the best sleep happens when I eat and drink well and go to bed at 22:00 after having done at least 30 minutes of exercise in the day. Even if it means a 30 minute walk. Without that, my brain might be tired, but my body isn't, and I have trouble falling and staying asleep.</p>\n<h3 id=\"summary\">Summary</h3>\n<p>A career in programming is a long-distance sprint. No, that's not an oxymoron. There are times when the pressure to meet a deadline is overwhelming, so we're sprinting to implement a solution. When that's not the case, we're simply learning something new, mixing our creative juices with our critical thinking and problem-solving.</p>\n<p>Mental and emotional stamina, resilience, flexibility, and raw power are necessary to thrive in such an environment. So we have to take care of ourselves and utilize our resources to the best of our personal abilities.</p>\n<p>Sorry if that was long-winded.</p>"}]