[{"keywords":"Dennis Mai, Weird Wide Web, Brazilian Jiu Jitsu, BJJ, Choke Holds, BJJ Strangulations","title":"My Favorite BJJ Chokes","description":"An oddly specific list of Dennis Mai's favoriate Brazilian Jiu jitsu chokes and strangulations.","extension":".md","updatedAt":1606236840270,"toc":[{"id":"chokes-and-strangulations---my-favorite-ways-to-safely-submit-someone","depth":1,"text":"Chokes and Strangulations - My Favorite Ways to Safely Submit Someone"},{"id":"summary","depth":1,"text":"Summary"}],"body":"<h1 id=\"chokes-and-strangulations---my-favorite-ways-to-safely-submit-someone\">Chokes and Strangulations - My Favorite Ways to Safely Submit Someone</h1>\n<p>This may sound weird (or it won't, if you're familiar with Jiu Jitsu), but I have a very specific list of favorite chokes for Jiu Jitsu.</p>\n<p>In order, they have GOT to be:</p>\n<ol>\n<li>The Ezekiel Choke</li>\n<li>The Loop Choke</li>\n<li>The Rear Naked Choke</li>\n<li>The Bow-and-Arrow Choke</li>\n<li>The Anaconda</li>\n<li>The D'arce</li>\n<li>The North-South Choke</li>\n<li>The Peruvian Necktie</li>\n<li>The Arm-in Guillotine</li>\n<li>THE MOTHER'S MILK\nBONUS. The Triangle Choke. (This should be #1, but it's such a staple. C'mon!)</li>\n</ol>\n<p>I'll go into the details for each one below, but suffice it to say, this is a non-exhaustive list of awesome chokes everybody doing BJJ should know.</p>\n<h1 id=\"summary\">Summary</h1>\n<p>Chok</p>"},{"keywords":"ejs, webpack, blog, markdown, simple blog, Vanilla JS, GSAP, Lean Web, JAM Stack","title":"Dennis Mai - How I Made My Blog","description":"How I made my blog using just ejs, webpack, scss, and vanilla JS. (And GSAP for animations. It's unnecessary -- but fun)","extension":".md","updatedAt":1605049200000,"toc":[{"id":"how-i-made-this-blog","depth":1,"text":"How I Made This Blog"},{"id":"the-tech","depth":2,"text":"The Tech"},{"id":"ejs","depth":3,"text":"EJS"},{"id":"i-am-using-webpack-version-4","depth":3,"text":"I am using Webpack version 4"},{"id":"sass-scss","depth":3,"text":"SASS (scss)"},{"id":"vanilla-javascript","depth":3,"text":"Vanilla Javascript"},{"id":"gsap","depth":3,"text":"GSAP"},{"id":"project-setup","depth":3,"text":"Project Setup"},{"id":"multi-page-sites-with-webpack","depth":4,"text":"Multi-page sites with Webpack"},{"id":"transform-markdown-to-ejs-and-then-to-plain-html","depth":4,"text":"Transform Markdown to EJS and then to plain HTML"},{"id":"updating-posts-and-preventing-full-rewrites","depth":4,"text":"Updating Posts and Preventing Full Rewrites"},{"id":"dynamic-entry-object-for-webpack","depth":4,"text":"Dynamic entry object for Webpack"},{"id":"the-html-files","depth":4,"text":"The HTML files"},{"id":"caveat","depth":4,"text":"Caveat"},{"id":"summary","depth":2,"text":"Summary"}],"body":"<h1 id=\"how-i-made-this-blog\">How I Made This Blog</h1>\n<p>First, this is a custom solution that's probably only applicable for small blogs (less than a few hundred posts). Anything more will take a long time to build, for reasons I will explain below.</p>\n<p>Second, This blog was built just for fun. While webpack supports building multiple pages with multiple entry points, it was probably never intended for full-blown blog building. There are other tools better suited for the job, like Next.js, Huge, Jekyll, Eleventy, and the like.</p>\n<p>That said, if you want to do something similar just for fun, read on!</p>\n<h2 id=\"the-tech\">The Tech</h2>\n<p>I tried to make a blog using the SIMPLEST technlogies available, with as few tools as possible while still allowing for website optimizations.</p>\n<ul>\n<li><a href=\"https://ejs.co/\">EJS</a> templates to reuse components.</li>\n<li><a href=\"https://webpack.js.org/\">Webpack v4</a> for the dev server, building, and optimizations.</li>\n<li><a href=\"https://sass-lang.com/documentation/syntax\">SASS</a> for reusing CSS.</li>\n<li><a href=\"https://vanillajstoolkit.com/\">Vanilla JS</a>, because I don't like dependencies. Webpack is terrible enough.</li>\n<li><a href=\"https://greensock.com/docs/\">GSAP</a> For animations. This website is actually my first time using GSAP.</li>\n</ul>\n<h3 id=\"ejs\">EJS</h3>\n<p>Why? Because I'm already very familiar with the syntax. And when building projects that you expect to last a while, it's probably best to use an 80/20 stack mix of tech you know well with new tech you want to learn, which is why...</p>\n<h3 id=\"i-am-using-webpack-version-4\">I am using Webpack version 4</h3>\n<p>Webpack 5 just came out, and its release is a hot debate, because, well, it's like they didn't even try to see what would and wouldn't break. I know and love (and kind of hate) Webpack 4, so I'm stickin' with the old guns for now.</p>\n<h3 id=\"sass-scss\">SASS (scss)</h3>\n<p>I love it. It's actually mostly unnecessary with the power of the current CSS3 api, but, again, I know it well and I enjoy it.</p>\n<h3 id=\"vanilla-javascript\">Vanilla Javascript</h3>\n<p>This was a no-brainer. At the time of this writing, I'm only familiar with React. I'm no expert, but I'm certainly no novice at this point. I would love to learn Vue, Svelte, Preact, and even Angular, but I also want this site to be as fast as possible and rely on as few dependencies as possible. And that's not a realistic expection when using those Javascript libraries or frameworks. Vanilla Javascript is good. It's performant, and you really don't need more.</p>\n<h3 id=\"gsap\">GSAP</h3>\n<p>Okay, GSAP is my 20%. I had never worked with GSAP before and had only heard good things. So I'm giving it a shot, and so far, it's wonderful. Very fun, very intuitive, and VERY powerful. Highly recommended.</p>\n<h3 id=\"project-setup\">Project Setup</h3>\n<pre><code>root    |- configs...\n        |- src  |- components\n                |- fonts\n                |- images\n                |- pages\n                |- posts\n                |- scripts\n                |- styles\n                |- views\n</code></pre>\n<p>I have all the code in the root/src folder with configs for postcss and webpack under the root directory. I use separate webpack configs for dev and production and use webpack-merge to merge them with common configurations.</p>\n<p>I am also hosting on Netlify, which is its own topic.</p>\n<p>In my src folder, I have directories hosting my assets.</p>\n<p>I have styles in its own folder, but you can host them any way you like, including next to their pages (or their views or their components or wherever. It doesn't matter).</p>\n<p>Of particular importance are my pages, posts, and views folders.</p>\n<h4 id=\"multi-page-sites-with-webpack\">Multi-page sites with Webpack</h4>\n<p>My Webpack entry points are pointing the pages directory. Each file there there is its own entrypoint, except for blog posts. There is 1 entrypoint for each post (in the posts directory), which all use the same styles and javscript. This is not ideal, but I couldn't get webpack to reuse my entrypoints with the splutChunks options. I might try it again later, but it was extremely frustrating.</p>\n<h4 id=\"transform-markdown-to-ejs-and-then-to-plain-html\">Transform Markdown to EJS and then to plain HTML</h4>\n<p>I am using <a href=\"https://github.com/cenguidanos/node-markdown-parser\">@cenguidanos/node-markdown-parser</a> to return an array of all my posts with their meta content such as title, description and keywords in a json object. To do that, I make use of <code>fs.readdirSync</code> and <code>fs.readFileSync</code> to grab the all the posts and their data.</p>\n<p>With that data, I construct an ejs template that reuses header and footer components. I then write the template to a corresponding ejs file in the views directory using <code>fs.writeFile</code>.</p>\n<h4 id=\"updating-posts-and-preventing-full-rewrites\">Updating Posts and Preventing Full Rewrites</h4>\n<p>The tools provided don't provide a simple way of checking if the date being written or read is new or old. In particular the markdown parser will simply create the file with a new updatedAt date, which can be problematic when you didn't update the post.</p>\n<p>The way I dealt with this problem is actually be keeping the list of blog data in a simple database file called db.json, to which I compare the new blog data. We construct a new array of the blog data using old, unchanged entries with new and updated entries and write that to the 'database'. This way, the keep the meta data -- especially the updatedAt date -- in tact.</p>\n<h4 id=\"dynamic-entry-object-for-webpack\">Dynamic entry object for Webpack</h4>\n<p>Before I create any html files, though, I have to create my entry points for Webpack. Using the pages directory, I construct an object with the name of the page file and its path. For posts, I begin with the name 'posts1', since I will need to create 1 entry for each blog post (ugh. Annoying. And VERY non-performant).</p>\n<h4 id=\"the-html-files\">The HTML files</h4>\n<p>Now, in order to create all those html files with their css and js files embedded, I get all the ejs files from the views directory and use the <a href=\"https://www.npmjs.com/package/glob\">glob</a> package to get their paths. It's also possible with the fs module, but glob is easier.</p>\n<p>I then use <code>Array.reduce()</code> to construct a new array of HtmlWebpackPlugin instances of ALL the ejs files, injecting their meta data and associating the appropriate chunk (css and js file) with their names. if they are posts, I have to handle them slightly differently.</p>\n<p>Here, I also check if the ejs file is associated with a post that was deleted (no longer in the posts directory). If it's not there, posts is undefined, so I use <code>fs.unlink</code> to delete it from the views.</p>\n<p>In the Webpack Plugins array, I concat the HtmlWebpackPlugins array with MiniCssExtractPlugin, Critters to inline the css, and CleanWebpackPlugin.</p>\n<p>The rest is of my webpack config is just configuring scss, ejs, injecting my fonts and images, and setting node rules for different modules.</p>\n<p>And there you have it!</p>\n<h4 id=\"caveat\">Caveat</h4>\n<p>With ejs templates in webpack, the dev server with not reload the browser if there are nested ejs templates, which is annoying. The dev server only check if the entrypoint files or their indexes (root ejs pages) have changed.</p>\n<h2 id=\"summary\">Summary</h2>\n<p>This was a lot of setup for a small blog. But it's pretty lightweight, and a lot easier to set up than a full-blown blog CRUD app.</p>\n<p>That set, it's probably easier to use Huge, Jekyll, or Eleventy. I'll experiment with those later.</p>"},{"keywords":"Dennis Mai, Blog, Development, Weird Wide Web, Node, Webpack, EJS, Vanilla JS, Lean Web, JAMstack","title":"Dennis Mai - Introduction to My Blog","description":"A short introduction to Dennis Mai's blog and website.","extension":".md","updatedAt":1606207824976,"toc":[{"id":"introduction-to-this-website-and-blog","depth":1,"text":"Introduction to this Website and Blog"},{"id":"an-innocent-time","depth":2,"text":"An innocent time..."},{"id":"this-place-isnt-100-accessible","depth":2,"text":"This place isn't 100% Accessible"}],"body":"<h1 id=\"introduction-to-this-website-and-blog\">Introduction to this Website and Blog</h1>\n<p>Greetings brave world wide web surfer<a href=\"#note1\">*</a> and welcome back to the weird web!</p>\n<p>This website is an expression of myself, my tastes, my thoughts. It's a throwback to the indie web, when people were using AOL Instant Messenger, MSN Messenger, Xanga, MySpace, LiveJournal, and Google Blogs to connect with others. This is my digital garden, and I hope it evokes the same sense of nostalgia for you as it does for me for a time long past.</p>\n<h2 id=\"an-innocent-time\">An innocent time...</h2>\n<p>This website is also my own custom blog. It is far from perfect, but it's mine. In here, I write about technology, culture, society, Brazilian Jiu Jitsu, Fatherhood, being a husband (husband...hood?), and other things, too. I hope my writing inspires and provokes you, dear reader.</p>\n<h2 id=\"this-place-isnt-100-accessible\">This place isn't 100% Accessible</h2>\n<p>I try to make sure everybody can digest my content, but, you know what? I won't be able to make everyone happy. And that's okay. That's life. I'm sorry if I offend any of you (truly, I am). This place is a work in progress, and I will continue to make it as accessible to as many people as I can.</p>\n<p>That said, you can always send me feedback via email.</p>\n<p>Enjoy the tour, and and I hope you'll be inspiried to make the web a little bit better. And a little bit weirder.</p>\n<p><a name=\"note1\"></a> When the internet was first becoming popular, it was called the \"World Wide Web\", and those browsing the internet then were \"surfing the web.\" Good times.</p>"}]